bigjosh/Move38-Arduino-Platform/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

menu.datagrams=Datagrams

##############################################################

blink.name=Blink

blink.vid.0=0x2341
blink.pid.0=0x0043
blink.vid.1=0x2341
blink.pid.1=0x0001
blink.vid.2=0x2A03
blink.pid.2=0x0043
blink.vid.3=0x2341
blink.pid.3=0x0243

blink.upload.tool=avrdude
# IMPORTANT: Do not put a protocol here. 
# If the protocol is `null` then Arduino will fall back and use 
# whatever programmer is selected in Tools->Programmer


# This is the maximum size of a program image. It comes from 
# `blinkbios.h` and is the result of `FLASH_PAGES_PER_IMAGE` * `FLASH_BYTES_PER_PAGE`
# Used only for printing the "Sketch uses... of program stroage space..." message.
blink.upload.maximum_size=5888
blink.upload.maximum_data_size=1024
blink.upload.speed=115200

#blink.bootloader.tool=avrdude
#blink.bootloader.low_fuses=0xFF
#blink.bootloader.high_fuses=0xDE
#blink.bootloader.extended_fuses=0xFD
#blink.bootloader.unlock_bits=0x3F
#blink.bootloader.lock_bits=0x0F

# Note that the folder `bootloaders` seems to be hardcoded into the Ardunio IDE

blink.bootloader.file=BlinkBIOS.hex

blink.build.mcu=atmega168pb
blink.build.f_cpu=8000000L
blink.build.board=AVR_BLINK
blink.build.core=blinklib
blink.build.variant=standard

blink.menu.datagrams.enabled=Enabled
blink.menu.datagrams.enabled.build.datagramflag=enabled
blink.menu.datagrams.disabled=Disabled
blink.menu.datagrams.disabled.build.datagramflag=disabled

##############################################################

